{
    "lectures": [
        {
            "id": 1,
            "title": "Lecture 1: Mathematical foundations, Keyframe technology and Velocity Control",
            "intro": "This lecture introduces the mathematical foundations of geometric transformations, rotation representations, and spline-based keyframe interpolation, presenting a unified framework for achieving smooth, controllable, and physically plausible motion in computer animation."
        },
        {
            "id": 2,
            "title": "Lecture 2: Particle Systems",
            "intro": "This lecture systematically introduces how particle systems can efficiently simulate the blurring phenomenon in nature and special effects by simplifying physical modeling, numerical integration, and diverse rendering methods. It further extends to advanced technologies such as material point methods to achieve realistic and controllable dynamic visual effects."
        },
        {
            "id": 3,
            "title": "Lecture 3: 2D Image Morphing",
            "intro": "This lecture systematically introduces the basic principles and classic algorithms of 2D image deformation. It demonstrates how to achieve smooth transition animations based on grids and feature lines by combining geometric transformations and color fusion, and extends the application to viewpoint deformation and modern learning methods."
        },
        {
            "id": 4,
            "title": "Lecture 4: Portrait Morphing and 2D Polygon Shape Gradients Based on StyleGAN",
            "intro": "This lecture integrates deep generative models with classical geometric methods, systematically explaining portrait deformation techniques based on StyleGAN and diffusion models, as well as two-dimensional polygon shape gradation methods based on intrinsic geometric constraints, achieving a balance between high realism and strong controllability."
        },
        {
            "id": 5,
            "title": "Lecture 5: 3D Image Morphing",
            "intro": "This lecture systematically introduces the core ideas and main technical routes of 3D shape deformation, covering methods based on surface parameterization, voxel representation and implicit functions, to achieve high-quality 3D morphological transitions from geometrically consistent deformation to complex topological changes."
        },
        {
            "id": 6,
            "title": "Lecture 6: Group Animation (I)",
            "intro": "Mesh deformation techniques and shape interpolation."
        },
        {
            "id": 7,
            "title": "Lecture 7: Group Animation (II)",
            "intro": "Motion capture technology and data processing."
        },
        {
            "id": 8,
            "title": "Lecture 8: Joint (character) animation (I)",
            "intro": "Algorithmic animation generation and behavioral systems."
        },
        {
            "id": 9,
            "title": "Lecture 9: Joint (character) animation (II)",
            "intro": "Facial rigging, blend shapes, and expression systems."
        },
        {
            "id": 10,
            "title": "Lecture 10: Joint (character) animation (III)",
            "intro": "Cloth simulation, fluid dynamics, and modern techniques."
        },
        {
            "id": 11,
            "title": "Lecture 11: Deformable Animation",
            "intro": ""
        },
        {
            "id": 12,
            "title": "Lecture 12: Cloth Animation",
            "intro": ""
        },
        {
            "id": 13,
            "title": "Lecture 13: Implicit function surface modeling and animation techiniques",
            "intro": ""
        }
    ]
}